
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |   🔴 Destroy |
|----------:|---------:|------------:|-------------:|
|        ✅ |        7 |           7 |            6 |
## Affected resources by action

|  Action  | Resources                                                                                  |
|:--------:|:-------------------------------------------------------------------------------------------|
|    🟢    | `module.jumphost.aws_key_pair.deployer`                                                    |
|    🟢    | `module.jumphost.tls_private_key.deployer`                                                 |
|    🟡    | `module.jumphost.aws_autoscaling_group.jumphost`                                           |
|    🟡    | `module.jumphost.aws_efs_mount_target.packages["subnet-06caf71c8b0afd909"]`                |
|    🟡    | `module.jumphost.aws_efs_mount_target.packages["subnet-0f91dd2675e7a16c3"]`                |
|    🟡    | `module.jumphost.aws_iam_policy.required`                                                  |
|    🟡    | `module.jumphost.aws_launch_template.jumphost`                                             |
|    🟡    | `module.jumphost.aws_lb.jumphost`                                                          |
|    🟡    | `module.jumphost.module.jumphost_profile.aws_iam_policy.profile`                           |
|    🔴    | `module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["required"]` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.jumphost.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ec2:DescribeInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:70d22604-e11b-4b9d-95e6-f5f41a1208d6:autoScalingGroupName/jumphost-20240223005113359100000009-02R7BZ",
            ]
        }
    }

  # module.jumphost.aws_autoscaling_group.jumphost will be updated in-place
  ~ resource "aws_autoscaling_group" "jumphost" {
        id                               = "jumphost-20240223005113359100000009-02R7BZ"
        name                             = "jumphost-20240223005113359100000009-02R7BZ"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "22" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (11 unchanged blocks hidden)
    }

  # module.jumphost.aws_efs_mount_target.packages["subnet-06caf71c8b0afd909"] will be updated in-place
  ~ resource "aws_efs_mount_target" "packages" {
        id                     = "fsmt-05668d06fda5b96b6"
      ~ security_groups        = [
          - "sg-02906b36c9d1be156",
        ] -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.jumphost.aws_efs_mount_target.packages["subnet-0f91dd2675e7a16c3"] will be updated in-place
  ~ resource "aws_efs_mount_target" "packages" {
        id                     = "fsmt-0d025cfc9c7ee2852"
      ~ security_groups        = [
          - "sg-02906b36c9d1be156",
        ] -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.jumphost.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::493370826424:policy/terraform-20240223005145929800000014"
        name             = "terraform-20240223005145929800000014"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "autoscaling:DescribeAutoScalingInstances"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:70d22604-e11b-4b9d-95e6-f5f41a1208d6:autoScalingGroupName/jumphost-20240223005113359100000009-02R7BZ"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
        # (7 unchanged attributes hidden)
    }

  # module.jumphost.aws_key_pair.deployer will be created
  + resource "aws_key_pair" "deployer" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = (known after apply)
      + key_name_prefix = "jumphost-deployer-generated-"
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags            = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
          + "service"           = "jumphost"
        }
      + tags_all        = {
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
          + "service"           = "jumphost"
        }
    }

  # module.jumphost.aws_launch_template.jumphost will be updated in-place
  ~ resource "aws_launch_template" "jumphost" {
        id                                   = "lt-001743d1d2257c40b"
      ~ image_id                             = "ami-0d0c2d90947a3e2a6" -> "ami-0b6b9f5165afb1635"
      ~ key_name                             = "aleks" -> (known after apply)
      ~ latest_version                       = 22 -> (known after apply)
        name                                 = "jumphost-20240223005113359100000009"
        tags                                 = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
        # (15 unchanged attributes hidden)

      ~ metadata_options {
          + instance_metadata_tags      = "enabled"
            # (4 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.jumphost.aws_lb.jumphost will be updated in-place
  ~ resource "aws_lb" "jumphost" {
        id                                                           = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/net/jumpho20240226175403880200000003/b3fc749d99e1aea6"
        name                                                         = "jumpho20240226175403880200000003"
      ~ tags                                                         = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
          + "module_version"    = "3.0.0"
            "service"           = "jumphost"
        }
      ~ tags_all                                                     = {
          + "module_version"    = "3.0.0"
            # (5 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.jumphost.aws_security_group.efs must be replaced
-/+ resource "aws_security_group" "efs" {
      ~ arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group/sg-02906b36c9d1be156" -> (known after apply)
      ~ description            = "Security group for pypiserver EFS volume" -> "Security group for the EFS volume" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ id                     = "sg-02906b36c9d1be156" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all ICMP traffic"
              - from_port        = -1
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "icmp"
              - security_groups  = []
              - self             = false
              - to_port          = -1
            },
          - {
              - cidr_blocks      = [
                  - "10.0.3.0/24",
                  - "10.0.1.0/24",
                ]
              - description      = "Allow NFS traffic to EFS volume"
              - from_port        = 2049
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 2049
            },
        ] -> (known after apply)
      ~ name                   = "jumphost-efs-20240226175402899600000001" -> (known after apply)
      ~ owner_id               = "493370826424" -> (known after apply)
        tags                   = {
            "Name"              = "Jumphost EFS home"
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
        # (4 unchanged attributes hidden)
    }

  # module.jumphost.aws_vpc_security_group_egress_rule.efs must be replaced
-/+ resource "aws_vpc_security_group_egress_rule" "efs" {
      ~ arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-0db18bc63ee576445" -> (known after apply)
      ~ id                     = "sgr-0db18bc63ee576445" -> (known after apply)
      ~ security_group_id      = "sg-02906b36c9d1be156" -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-0db18bc63ee576445" -> (known after apply)
        tags                   = {
            "Name"              = "EFS outgoing traffic"
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
        # (3 unchanged attributes hidden)
    }

  # module.jumphost.aws_vpc_security_group_ingress_rule.efs["subnet-06caf71c8b0afd909"] must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "efs" {
      ~ arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-062acb6f39fde831e" -> (known after apply)
      ~ id                     = "sgr-062acb6f39fde831e" -> (known after apply)
      ~ security_group_id      = "sg-02906b36c9d1be156" -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-062acb6f39fde831e" -> (known after apply)
        tags                   = {
            "Name"              = "NFS traffic"
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
        # (6 unchanged attributes hidden)
    }

  # module.jumphost.aws_vpc_security_group_ingress_rule.efs["subnet-0f91dd2675e7a16c3"] must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "efs" {
      ~ arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-0444ad8346816a952" -> (known after apply)
      ~ id                     = "sgr-0444ad8346816a952" -> (known after apply)
      ~ security_group_id      = "sg-02906b36c9d1be156" -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-0444ad8346816a952" -> (known after apply)
        tags                   = {
            "Name"              = "NFS traffic"
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
        # (6 unchanged attributes hidden)
    }

  # module.jumphost.aws_vpc_security_group_ingress_rule.efs_icmp must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "efs_icmp" {
      ~ arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-05152071ab2f7b9e3" -> (known after apply)
      ~ id                     = "sgr-05152071ab2f7b9e3" -> (known after apply)
      ~ security_group_id      = "sg-02906b36c9d1be156" -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-05152071ab2f7b9e3" -> (known after apply)
        tags                   = {
            "Name"              = "ICMP traffic"
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
        # (6 unchanged attributes hidden)
    }

  # module.jumphost.tls_private_key.deployer will be created
  + resource "tls_private_key" "deployer" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # module.jumphost.module.jumphost_profile.aws_iam_policy.profile will be updated in-place
  ~ resource "aws_iam_policy" "profile" {
        id               = "arn:aws:iam::493370826424:policy/jumphost-Zv01ElhajbB620240223005112022800000002"
        name             = "jumphost-Zv01ElhajbB620240223005112022800000002"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ec2:Describe*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "created_by_module" = "infrahouse/instance-profile/aws"
        }
        # (7 unchanged attributes hidden)
    }

  # module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["required"] will be destroyed
  # (because key ["required"] is not in for_each map)
  - resource "aws_iam_role_policy_attachment" "extra" {
      - id         = "jumphost-Zv01ElhajbB620240223005112032800000005-20240223005146325300000016" -> null
      - policy_arn = "arn:aws:iam::493370826424:policy/terraform-20240223005145929800000014" -> null
      - role       = "jumphost-Zv01ElhajbB620240223005112032800000005" -> null
    }

Plan: 7 to add, 7 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDcsICJjaGFuZ2UiOiA3LCAiZGVzdHJveSI6IDZ9fQ==
```
</details>